cafe/frontend/views/cart/index.php

SELECT * FROM `category`
SELECT COUNT(*) FROM `product` WHERE `category_id`=9
---
                <div class="shop-widget">
                    <h4>MENU</h4>
                    <ul class="category-shop-list">
                        <?php $category = backend\models\Category::find()->all();?>
                        <?php foreach ($category as $item): ?>
                            <?php $count = backend\models\Product::find()->where(['category_id'=>$item->id])->count();?>

SELECT * FROM `product` LIMIT 4
---
                </div>
                <div class="shop-widget">
                    <h4><i class="fa fa-heart"></i>được yêu thích</h4>
                    <?php $product = backend\models\Product::find()->limit(4)->all(); ?>