cafe/frontend/controllers/SiteController.php

    public function actionCategory($id)
    {
        $cart = new Cart();
        $total = $cart->getTotalItem();
        $products = Product::find()
            ->where(["category_id" => $id])
            ->all();
        $count = Product::find()
            ->where(["category_id" => $id])
            ->count();
---
SELECT * FROM `product` WHERE `category_id`='9'
SELECT COUNT(*) FROM `product` WHERE `category_id`='9'

    public function actionView($id)
    {
        $cart = new Cart();
        $total = $cart->getTotalItem();
        $product = Product::findOne($id);
        $category = Product::find()
            ->where(["category_id" => $product->category_id])
            ->limit(3)
            ->all();
        $product = Product::findOne($id);
        $comments = Comment::find()
            ->where(["product_id" => $id])
            ->all();
        $reviews = Review::find()
            ->where(['product_id' => $id])
            ->all();

        $view = View::find()
            ->where(['product_id' => $id])
            ->all();
---
SELECT * FROM `product` WHERE `id`='30'
SELECT * FROM `product` WHERE `category_id`=9 LIMIT 3
SELECT * FROM `comment` WHERE `product_id`='30'
SELECT * FROM `reviews` WHERE `product_id`='30'
SELECT * FROM `views` WHERE `product_id`='30'

        $userId = Yii::$app->user->id;

// Kiểm tra xem người dùng đã có đánh giá cho sản phẩm chưa
$existingReview = Review::findOne(['user_id' => $userId, 'product_id' => $id]);
---
SELECT * FROM `reviews` WHERE (`user_id`=3) AND (`product_id`='30')

        $existingReview->rating = $reviewModel->rating;
        $existingReview->comment = $reviewModel->comment;
        $existingReview->created_at = time();
        $existingReview->save();
---
UPDATE `reviews` SET `rating`=5, `comment`='Sách hay, giao hàng nhanh', `created_at`=1691055132 WHERE `id`=1

    public function actionIndex()
    {
        $products = Product::find()
            ->limit(40)
            ->all();
---
SELECT * FROM `product` LIMIT 40