cafe/frontend/views/site/category.php

                <div class="shop-widget">
                    <h4>Categories</h4>
                    <ul class="category-shop-list">
                        <?php $category = backend\models\Category::find()->all();?>
                        <?php foreach ($category as $item): ?>
                            <?php $count = backend\models\Product::find()->where(['category_id'=>$item->id])->count();?>
---
SELECT * FROM `category`
SELECT COUNT(*) FROM `product` WHERE `category_id`=9