cafe/frontend/views/site/view.php

      </p>
      <p>
         <?php
            $category = backend\models\Category::find()->where(["id" => $product->category_id])->asArray()->one();
---
SELECT * FROM `category` WHERE `id`=9

<div class="shop-widget">
<h4>Categories</h4>
<ul class="category-shop-list">
<?php $category = backend\models\Category::find()->all(); ?>
<?php foreach ($category as $item): ?>
<?php $count = backend\models\Product::find()
   ->where(["category_id" => $item->id])
   ->count(); ?>
---
SELECT * FROM `category`
SELECT COUNT(*) FROM `product` WHERE `category_id`=9

</div>
<div class="shop-widget">
<h4>được yêu thích</h4>
<?php $product = backend\models\Product::find()
   ->limit(2)
   ->all(); ?>
---
SELECT * FROM `product` LIMIT 2