cafe/frontend/views/layouts/main.php

SELECT * FROM `category`
---
        <li class="dropdown">
            <a href="#" data-toggle="dropdown" class="dropdown-toggle"><i class="fas fa-book"></i> Loại Sách</a>
            <ul class="dropdown-menu">
                <?php $category = backend\models\Category::find()->all(); ?>